"""
Конфигурация для модуля преобразования данных.

Содержит настройки, определяющие ограничения на размер файлов и правила обработки CSV-файлов.
"""


class ConvertersConfig:
    """
    Конфигурация для модуля backend/converters.

    Содержит ограничения на размер входных данных и параметры автоопределения
    разделителей в CSV-файлах.

    Attributes
    ----------
    MAX_FILE_ROWS : int
        Максимальное количество строк в CSV/Excel файле.
    CSV_DELIMITERS : list of str
        Допустимые разделители для CSV (для автоопределения).
    CSV_DEFAULT_DELIMETER : str
        Разделитель по умолчанию, если не удалось определить разделитель автоматически.
    """

    MAX_FILE_ROWS = 500
    CSV_DELIMITERS = [",", "\t", ";", " "]
    CSV_DEFAULT_DELIMETER = ","
